
running /Users/dstegmue/Library/Application Support/Stata/ado/personal/profile.
> do ...
 
To start PanelWhiz: Stata | User | PanelWhiz | Start 
 
unrecognized command:  window
r(199);


. /* 
> Step 1 of 6
> Combines 4 ESS data sets and executes some
> basic recodes (incl. income calculations).
> */
. 
. * Requires (from SSC): dropmiss
. 
. * ESS original source files:
. * Downloaded from 
. * ess1e06.dta (ESS 1)
. * ESS1csFR.dta (file for income in France)
. * ESS1csIE.dta (file for income in Ireland)
. * ess2e03.dta (ESS 2)
. * ESS2csFR.dta (file for income in France)
. * ess3e03.dta (ESS 3)
. * ess4e02.dta (ESS 4)
. 
. 
. 
. * Note: turn on word-wrap in your text editor
. 
. 
. 
. 
. set more off

. 
. * =========
. * = ESS 1 =
. * =========
. use "original_ESS_files/ess1e06.dta", clear

. keep if cntry=="AT"|cntry=="BE"|cntry=="CH"|cntry=="DE"|cntry=="DK"|cntry=="E
> S"|cntry=="FI"| cntry=="FR"|cntry=="GB"|cntry=="IE"|cntry=="NL"|cntry=="NO"| 
> cntry=="SE"|cntry=="PT"
(14498 observations deleted)

. 
. merge 1:1 cntry idno using "original_ESS_files/ESS1csFR.dta", keepusing(hinct
> nfr wrkctfr rlgdnmfr)
(note: variable idno was long, now double to accommodate using data's values)
(label occm14 already defined)
(label occf14 already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        26,358
        from master                    26,358  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,503  (_merge==3)
    -----------------------------------------

. replace hinctnt = hinctnfr if cntry == "FR"
(1503 real changes made)

. replace rlgdnm = rlgdnmfr if cntry == "FR"
(1503 real changes made)

. recode wrkctfr (3 4 = 2) (5=6)
(wrkctfr: 120 changes made)

. replace wrkctr = wrkctfr if cntry == "FR"
(845 real changes made)

. drop _merge

. 
. merge 1:1 cntry idno using "original_ESS_files/ESS1csIE.dta", keepusing(hinct
> nie)

    Result                           # of obs.
    -----------------------------------------
    not matched                        25,815
        from master                    25,815  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,046  (_merge==3)
    -----------------------------------------

. replace hinctnt = hinctnie if cntry == "IE"
(2046 real changes made)

. 
. recode hincsrc (77/99=.)
(hincsrc: 440 changes made)

. 
. keep essround idno cntry lrscale gincdif happy ctzcntr brncntr hhmmb yrbrn gn
> dr domicil edulvl eduyrs emplrel emplno jbspv njbspv mnactic wrkctr  iscoco n
> acer1 hinctnt hincfel uemp3m edulvlf emprf14 emplnof jbspvf edulvlm emprm14 e
> mplnom jbspvm occm14ie regionat regionbe regionch regionde regiondk regiones 
> regionfi regionfr regiongb regionie  regionnl regionno regionpt regionse dwei
> ght pweight dvrcdev chldhm stflife health aesfdrk ipeqopt crmvct rlgdnm rlgat
> nd hincsrc

. 
. gen year = 2002

. 
. save ess1, replace
(note: file ess1.dta not found)
file ess1.dta saved

. 
. 
. * =========
. * = ESS 2 =
. * =========
. use "original_ESS_files/ess2e03.dta", clear

. keep if cntry=="AT"|cntry=="BE"|cntry=="CH"|cntry=="DE"|cntry=="DK"|cntry=="E
> S"|cntry=="FI"| cntry=="FR"|cntry=="GB"|cntry=="IE"|cntry=="NL"|cntry=="NO"| 
> cntry=="SE"|cntry=="PT"
(19690 observations deleted)

. 
. merge 1:1 cntry idno using "original_ESS_files/ESS2csFI.dta", keepusing(rlgdn
> mfi)
(note: variable idno was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        25,825
        from master                    25,825  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,022  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 cntry idno using "original_ESS_files/ESS2csFR.dta", keepusing(wrkct
> fr rlgdnmfr)
(label prtvtfr already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        26,041
        from master                    26,041  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,806  (_merge==3)
    -----------------------------------------

. drop _merge

. recode wrkctfr (3 4 = 2) (5=6)
(wrkctfr: 95 changes made)

. replace wrkctra = wrkctfr if cntry == "FR"
(1806 real changes made)

. replace rlgdnm = rlgdnmfr if cntry == "FR"
(1806 real changes made)

. replace rlgdnm = rlgdnmfi if cntry == "FI"
(2022 real changes made)

. 
. recode hincsrca (1=1) (2 3 =2) (4=3) (5=4) (6=5) (7=6) (8=7) (77/99=.), gen(h
> incsrc)
(9215 differences between hincsrca and hincsrc)

. 
. ren nacer11 nacer1 

. keep essround idno cntry lrscale gincdif happy ctzcntr brncntr hhmmb yrbrn gn
> dr domicil edulvl eduyrs emplrel emplno jbspv njbspv mnactic wrkctr  iscoco n
> acer1 hinctnt hincfel uemp3m edulvlf emprf14 emplnof jbspvf edulvlm emprm14 e
> mplnom jbspvm regionat regionbe regioach regionde regiondk regiones regioafi 
> regionfr regiongb regionie regionnl regionno regionpt regionse dweight pweigh
> t dvrcdev chldhm stflife health aesfdrk ipeqopt crmvct rlgdnm rlgatnd hincsrc

. 
. gen year = 2004

. 
. save ess2, replace
(note: file ess2.dta not found)
file ess2.dta saved

. 
. 
. * =========
. * = ESS 3 =
. * =========
. use "original_ESS_files/ess3e03.dta", clear

. keep if cntry=="AT"|cntry=="BE"|cntry=="CH"|cntry=="DE"|cntry=="DK"|cntry=="E
> S"|cntry=="FI"| cntry=="FR"|cntry=="GB"|cntry=="IE"|cntry=="NL"|cntry=="NO"| 
> cntry=="SE"|cntry=="PT"
(14832 observations deleted)

. 
. ren nacer11 nacer1 

. 
. recode hincsrca (1=1) (2 3 =2) (4=3) (5=4) (6=5) (7=6) (8=7) (77/99=.), gen(h
> incsrc)
(9689 differences between hincsrca and hincsrc)

. 
. keep essround idno cntry lrscale gincdif happy ctzcntr brncntr hhmmb yrbrn gn
> dr domicil edulvl eduyrs emplrel emplno jbspv njbspv mnactic wrkctr  iscoco n
> acer1 hinctnt hincfel uemp3m edulvlf emprf14 emplnof jbspvf edulvlm emprm14 e
> mplnom jbspvm regionat regionbe regioach regionde regiondk regioaes regioafi 
> regionfr regiongb regioaie regionnl regionno regionpt regionse dweight pweigh
> t dvrcdev chldhm stflife health aesfdrk ipeqopt crmvct rlgdnm rlgatnd hincsrc

. 
. gen year = 2006

. 
. save ess3, replace
(note: file ess3.dta not found)
file ess3.dta saved

. 
. 
. * =========
. * = ESS 4 =
. * =========
. use "original_ESS_files/ess4e02.dta", clear

. keep if cntry=="AT"|cntry=="BE"|cntry=="CH"|cntry=="DE"|cntry=="DK"|cntry=="E
> S"|cntry=="FI"| cntry=="FR"|cntry=="GB"|cntry=="IE"|cntry=="NL"|cntry=="NO"| 
> cntry=="SE"|cntry=="PT"
(16367 observations deleted)

. 
. ren nacer11 nacer1 

. 
. recode hincsrca (1=1) (2 3 =2) (4=3) (5=4) (6=5) (7=6) (8=7) (77/99=.), gen(h
> incsrc)
(8393 differences between hincsrca and hincsrc)

. 
. keep essround idno cntry lrscale gincdif happy ctzcntr brncntr hhmmb yrbrn gn
> dr domicil edulvl eduyrs emplrel emplno jbspv njbspv mnactic wrkctr  iscoco n
> acer1 hinctnt hincfel uemp3m edulvlf emprf14 emplnof jbspvf edulvlm emprm14 e
> mplnom jbspvm regionbe regioach regionde regioadk regioaes regioafi regionfr 
> regiongb regionnl regionno regioapt regionse dweight pweight dvrcdev chldhm  
> stflife health aesfdrk ipeqopt crmvct rlgdnm rlgatnd hincsrc

. 
. gen year = 2008

. 
. save ess4, replace
(note: file ess4.dta not found)
file ess4.dta saved

. 
. 
. 
. 
. 
. 
. * =================================================
. * = .............merge .......................... =
. * =================================================
.  /* note that region is not harmonized here! */
. 
. use ess1, clear

. append using ess2 ess3 ess4
(note: variable eduyrs was byte, now double to accommodate using data's
       values)
(note: variable njbspv was long, now double to accommodate using data's
       values)
(label lrscale already defined)
(label stflife already defined)
(label gincdif already defined)
(label happy already defined)
(label crmvct already defined)
(label aesfdrk already defined)
(label health already defined)
(label rlgdnm already defined)
(label rlgatnd already defined)
(label ctzcntr already defined)
(label brncntr already defined)
(label hhmmb already defined)
(label gndr already defined)
(label yrbrn already defined)
(label domicil already defined)
(label edulvl already defined)
(label eduyrs already defined)
(label mnactic already defined)
(label emplrel already defined)
(label emplno already defined)
(label jbspv already defined)
(label njbspv already defined)
(label iscoco already defined)
(label uemp3m already defined)
(label hinctnt already defined)
(label hincfel already defined)
(label edulvlf already defined)
(label emprf14 already defined)
(label emplnof already defined)
(label jbspvf already defined)
(label edulvlm already defined)
(label emprm14 already defined)
(label emplnom already defined)
(label jbspvm already defined)
(label dvrcdev already defined)
(label chldhm already defined)
(label ipeqopt already defined)
(label regionat already defined)
(label regionbe already defined)
(label regionde already defined)
(label regiondk already defined)
(label regiones already defined)
(label regionfr already defined)
(label regiongb already defined)
(label regionie already defined)
(label regionnl already defined)
(label regionno already defined)
(label regionpt already defined)
(label regionse already defined)
(label lrscale already defined)
(label stflife already defined)
(label gincdif already defined)
(label happy already defined)
(label crmvct already defined)
(label aesfdrk already defined)
(label health already defined)
(label rlgdnm already defined)
(label rlgatnd already defined)
(label ctzcntr already defined)
(label brncntr already defined)
(label hhmmb already defined)
(label gndr already defined)
(label yrbrn already defined)
(label domicil already defined)
(label edulvl already defined)
(label eduyrs already defined)
(label mnactic already defined)
(label emplrel already defined)
(label emplno already defined)
(label wrkctra already defined)
(label jbspv already defined)
(label njbspv already defined)
(label iscoco already defined)
(label nacer11 already defined)
(label uemp3m already defined)
(label hinctnt already defined)
(label hincfel already defined)
(label edulvlf already defined)
(label emprf14 already defined)
(label emplnof already defined)
(label jbspvf already defined)
(label edulvlm already defined)
(label emprm14 already defined)
(label emplnom already defined)
(label jbspvm already defined)
(label dvrcdev already defined)
(label chldhm already defined)
(label ipeqopt already defined)
(label regionat already defined)
(label regionbe already defined)
(label regioach already defined)
(label regionde already defined)
(label regiondk already defined)
(label regioafi already defined)
(label regionfr already defined)
(label regiongb already defined)
(label regionnl already defined)
(label regionno already defined)
(label regionpt already defined)
(label regionse already defined)
(label lrscale already defined)
(label stflife already defined)
(label gincdif already defined)
(label happy already defined)
(label crmvct already defined)
(label aesfdrk already defined)
(label health already defined)
(label rlgdnm already defined)
(label rlgatnd already defined)
(label ctzcntr already defined)
(label brncntr already defined)
(label hhmmb already defined)
(label gndr already defined)
(label yrbrn already defined)
(label domicil already defined)
(label edulvl already defined)
(label eduyrs already defined)
(label mnactic already defined)
(label emplrel already defined)
(label emplno already defined)
(label wrkctra already defined)
(label jbspv already defined)
(label njbspv already defined)
(label nacer11 already defined)
(label iscoco already defined)
(label uemp3m already defined)
(label hincfel already defined)
(label edulvlf already defined)
(label emprf14 already defined)
(label emplnof already defined)
(label jbspvf already defined)
(label edulvlm already defined)
(label emprm14 already defined)
(label emplnom already defined)
(label jbspvm already defined)
(label dvrcdev already defined)
(label chldhm already defined)
(label ipeqopt already defined)
(label regionbe already defined)
(label regioach already defined)
(label regionde already defined)
(label regioaes already defined)
(label regioafi already defined)
(label regionfr already defined)
(label regiongb already defined)
(label regionnl already defined)
(label regionno already defined)
(label regionse already defined)

. 
. 
. 
. * ========================================================
. * =  ...........recodes................................. =
. * ========================================================
. 
. * gen country-years
. gen str cntryyear= "------"

. foreach v in AT BE CH DE DK ES FI FR GB IE NL NO PT SE {
  2.   replace cntryyear = `"`v'1"' if cntry=="`v'" & essround==1
  3.   replace cntryyear = `"`v'2"' if cntry=="`v'" & essround==2
  4.   replace cntryyear = `"`v'3"' if cntry=="`v'" & essround==3
  5.   replace cntryyear = `"`v'4"' if cntry=="`v'" & essround==4
  6.   replace cntryyear = `"`v'5"' if cntry=="`v'" & essround==5
  7. }
(2257 real changes made)
(2256 real changes made)
(2405 real changes made)
(0 real changes made)
(0 real changes made)
(1899 real changes made)
(1778 real changes made)
(1798 real changes made)
(1760 real changes made)
(0 real changes made)
(2040 real changes made)
(2141 real changes made)
(1804 real changes made)
(1819 real changes made)
(0 real changes made)
(2919 real changes made)
(2870 real changes made)
(2916 real changes made)
(2751 real changes made)
(0 real changes made)
(1506 real changes made)
(1487 real changes made)
(1505 real changes made)
(1610 real changes made)
(0 real changes made)
(1729 real changes made)
(1663 real changes made)
(1876 real changes made)
(2576 real changes made)
(0 real changes made)
(2000 real changes made)
(2022 real changes made)
(1896 real changes made)
(2195 real changes made)
(0 real changes made)
(1503 real changes made)
(1806 real changes made)
(1986 real changes made)
(2073 real changes made)
(0 real changes made)
(2052 real changes made)
(1897 real changes made)
(2394 real changes made)
(2352 real changes made)
(0 real changes made)
(2046 real changes made)
(2286 real changes made)
(1800 real changes made)
(0 real changes made)
(0 real changes made)
(2364 real changes made)
(1881 real changes made)
(1889 real changes made)
(1778 real changes made)
(0 real changes made)
(2036 real changes made)
(1760 real changes made)
(1750 real changes made)
(1549 real changes made)
(0 real changes made)
(1511 real changes made)
(2052 real changes made)
(2222 real changes made)
(2367 real changes made)
(0 real changes made)
(1999 real changes made)
(1948 real changes made)
(1927 real changes made)
(1830 real changes made)
(0 real changes made)

. 
. 
. 
. * ===================
. * =       Age       =
. * ===================
. 
. recode yrbrn (7777/9999=.)
(yrbrn: 470 changes made)

. gen age = 999999

. replace age =  year - yrbrn
(108536 real changes made, 470 to missing)

. 
. * =====================
. * =     gender        =
. * =====================
. recode gndr (1=0)(2=1)(9=.),gen(female)
(108536 differences between gndr and female)

. 
. * ====================
. * =    education     =
. * ====================
. recode eduyrs (77/99=.)
(eduyrs: 1282 changes made)

. 
. * ======================
. * = income differences =
. * ======================
. recode gincdif (1=5) (2=4) (3=3) (4=2) (5=1) (7 8 9=.),gen(rincd)
(91867 differences between gincdif and rincd)

. 
. * ============================
. * =     Limited contract     =
. * ============================
. gen lmtctr = 0

. replace lmtctr = 1 if wrkctr == 2 & essround == 1
(3785 real changes made)

. replace lmtctr = 1 if wrkctra == 2 & (essround == 2 | essround == 3| essround
>  == 4| essround == 5)
(9627 real changes made)

. replace lmtctr = 1 if wrkctra == 3 & (essround == 2 | essround == 3| essround
>  == 4| essround == 5)
(6692 real changes made)

. 
. 
. * ===========================
. * =   Transfer classes      =
. * ===========================
. *Transfer class : coding Gelissen
. // 1 working  2 unempl  3 retired/disabled  4 Not in LF
. recode mnactic (1 = 1) (3 4 =2) (5 6 =3)  (2 7 8 9=4) (77 88 99= .),gen(trans
> fer)
(52431 differences between mnactic and transfer)

. 
. 
. * =================================
. * =    unemployment experience    =
. * =================================
.  recode uemp3m (1=1) (2=0) (7 8 9 = .), gen(uempl3)
(82026 differences between uemp3m and uempl3)

. 
. 
. * =================================
. * =           crime               =
. * =================================
. 
. /* fear */
. recode aesfdrk (7 8 9 = .), gen(fear)
(686 differences between aesfdrk and fear)

. 
. /* victim */
. recode crmvct (1=1) (2=0) (7 8 9=.), gen(victim)
(86157 differences between crmvct and victim)

. 
. * =================================
. * =      inequity / altriusm   
. * =================================
. recode ipeqopt (7 8 9 =.)
(ipeqopt: 2795 changes made)

. vreverse ipeqopt, gen(equalop)

. recode equalop (1 2=1) (3=2) (4=3) (5=4) (6=5)
(equalop: 101980 changes made)

. 
. 
. 
. /*===============================\
> | Income: in 2005 PPP US Dollars |
> \===============================*/
. 
. * ESS 1-3
. generate income=.
(108536 missing values generated)

. replace income=900 if hinctnt==1 // range Less than 1800, mid-point 900
(650 real changes made)

. replace income=2700 if hinctnt==2 // range 1800 to under 3600, mid-point 2700
(1371 real changes made)

. replace income=4800 if hinctnt==3 // range 3600 to under 6000, mid-point 4800
(2526 real changes made)

. replace income=9000 if hinctnt==4 // range 6000 to under 12000, mid-point 900
> 0
(7087 real changes made)

. replace income=15000 if hinctnt==5 // range 12000 to under 18000, mid-point 1
> 5000
(9188 real changes made)

. replace income=21000 if hinctnt==6 // range 18000 to under 24000, mid-point 2
> 1000
(8930 real changes made)

. replace income=27000 if hinctnt==7 // range 24000 to under 30000, mid-point 2
> 7000
(8158 real changes made)

. replace income=33000 if hinctnt==8 // range 30000 to under 36000, mid-point 3
> 3000
(7824 real changes made)

. replace income=48000 if hinctnt==9 // range 36000 to under 60000, mid-point 4
> 8000
(12809 real changes made)

. replace income=75000 if hinctnt==10 // range 60000 to under 90000, mid-point 
> 75000
(5423 real changes made)

. replace income=105000 if hinctnt==11 // range 90000 to under 120000, mid-poin
> t 105000
(1632 real changes made)

. 
. * ESS 4
. replace income=2500 if hinctnta==1&cntry=="BE"&essround==4 // range less than
>  5000mid-point 2500
(9 real changes made)

. replace income=7500 if hinctnta==2&cntry=="BE"&essround==4 // range 5000 to u
> nder 10000 mid-point 7500
(38 real changes made)

. replace income=11000 if hinctnta==3&cntry=="BE"&essround==4 // range 10000 to
>  under 12000 mid-point 11000
(76 real changes made)

. replace income=13000 if hinctnta==4&cntry=="BE"&essround==4 // range 12000 to
>  under 14000 mid-point 13000
(118 real changes made)

. replace income=15000 if hinctnta==5&cntry=="BE"&essround==4 // range 14000 to
>  under 16000 mid-point 15000
(111 real changes made)

. replace income=17000 if hinctnta==6&cntry=="BE"&essround==4 // range 16000 to
>  under 18000 mid-point 17000
(146 real changes made)

. replace income=19500 if hinctnta==7&cntry=="BE"&essround==4 // range 18000 to
>  under 21000 mid-point 19500
(168 real changes made)

. replace income=23500 if hinctnta==8&cntry=="BE"&essround==4 // range 21000 to
>  under 26000 mid-point 23500
(217 real changes made)

. replace income=30500 if hinctnta==9&cntry=="BE"&essround==4 // range 26000 to
>  under 35000 mid-point 30500
(283 real changes made)

. replace income=55000     if hinctnta==1&cntry=="DK"&essround==4  //     range
>    0       to      under   110000  mid-point       55000
(86 real changes made)

. replace income=129000 if hinctnta==2&cntry=="DK"&essround==4  //        range
>    110000  to      under   148000  mid-point       129000
(127 real changes made)

. replace income=167000 if hinctnta==3&cntry=="DK"&essround==4  //        range
>    148000  to      under   186000  mid-point       167000
(105 real changes made)

. replace income=206000 if hinctnta==4&cntry=="DK"&essround==4  //        range
>    186000  to      under   226000  mid-point       206000
(130 real changes made)

. replace income=251500 if hinctnta==5&cntry=="DK"&essround==4  //        range
>    226000  to      under   277000  mid-point       251500
(160 real changes made)

. replace income=307500 if hinctnta==6&cntry=="DK"&essround==4  //        range
>    277000  to      under   338000  mid-point       307500
(161 real changes made)

. replace income=365500 if hinctnta==7&cntry=="DK"&essround==4  //        range
>    338000  to      under   393000  mid-point       365500
(158 real changes made)

. replace income=421500 if hinctnta==8&cntry=="DK"&essround==4  //        range
>    393000  to      under   450000  mid-point       421500
(146 real changes made)

. replace income=492000 if hinctnta==9&cntry=="DK"&essround==4  //        range
>    450000  to      under   534000  mid-point       492000
(134 real changes made)

. replace income=5400 if hinctnta==1&cntry=="FI"&essround==4 // range less than
>  10800mid-point 5400
(156 real changes made)

. replace income=12600 if hinctnta==2&cntry=="FI"&essround==4 // range 10800 to
>  under 14400 mid-point 12600
(154 real changes made)

. replace income=16200 if hinctnta==3&cntry=="FI"&essround==4 // range 14400 to
>  under 18000 mid-point 16200
(175 real changes made)

. replace income=19800 if hinctnta==4&cntry=="FI"&essround==4 // range 18000 to
>  under 21600 mid-point 19800
(159 real changes made)

. replace income=24000 if hinctnta==5&cntry=="FI"&essround==4 // range 21600 to
>  under 26400 mid-point 24000
(207 real changes made)

. replace income=28800 if hinctnta==6&cntry=="FI"&essround==4 // range 26400 to
>  under 31200 mid-point 28800
(234 real changes made)

. replace income=34200 if hinctnta==7&cntry=="FI"&essround==4 // range 31200 to
>  under 37200 mid-point 34200
(245 real changes made)

. replace income=40800 if hinctnta==8&cntry=="FI"&essround==4 // range 37200 to
>  under 44400 mid-point 40800
(247 real changes made)

. replace income=49800 if hinctnta==9&cntry=="FI"&essround==4 // range 44400 to
>  under 55200 mid-point 49800
(249 real changes made)

. replace income=5700 if hinctnta==1&cntry=="FR"&essround==4 // range less than
>  11400mid-point 5700
(155 real changes made)

. replace income=12900 if hinctnta==2&cntry=="FR"&essround==4 // range 11400 to
>  under 14400 mid-point 12900
(163 real changes made)

. replace income=16200 if hinctnta==3&cntry=="FR"&essround==4 // range 14400 to
>  under 18000 mid-point 16200
(200 real changes made)

. replace income=19500 if hinctnta==4&cntry=="FR"&essround==4 // range 18000 to
>  under 21000 mid-point 19500
(131 real changes made)

. replace income=22500 if hinctnta==5&cntry=="FR"&essround==4 // range 21000 to
>  under 24000 mid-point 22500
(165 real changes made)

. replace income=26400 if hinctnta==6&cntry=="FR"&essround==4 // range 24000 to
>  under 28800 mid-point 26400
(211 real changes made)

. replace income=31200 if hinctnta==7&cntry=="FR"&essround==4 // range 28800 to
>  under 33600 mid-point 31200
(205 real changes made)

. replace income=36600 if hinctnta==8&cntry=="FR"&essround==4 // range 33600 to
>  under 39600 mid-point 36600
(222 real changes made)

. replace income=44400 if hinctnta==9&cntry=="FR"&essround==4 // range 39600 to
>  under 49200 mid-point 44400
(209 real changes made)

. replace income=6600 if hinctnta==1&cntry=="DE"&essround==4 // range less than
>  13200mid-point 6600
(269 real changes made)

. replace income=15350 if hinctnta==2&cntry=="DE"&essround==4 // range 13200 to
>  under 17500 mid-point 15350
(289 real changes made)

. replace income=19800 if hinctnta==3&cntry=="DE"&essround==4 // range 17500 to
>  under 22100 mid-point 19800
(322 real changes made)

. replace income=24550 if hinctnta==4&cntry=="DE"&essround==4 // range 22100 to
>  under 27000 mid-point 24550
(329 real changes made)

. replace income=29750 if hinctnta==5&cntry=="DE"&essround==4 // range 27000 to
>  under 32500 mid-point 29750
(297 real changes made)

. replace income=35400 if hinctnta==6&cntry=="DE"&essround==4 // range 32500 to
>  under 38300 mid-point 35400
(226 real changes made)

. replace income=41750 if hinctnta==7&cntry=="DE"&essround==4 // range 38300 to
>  under 45200 mid-point 41750
(201 real changes made)

. replace income=49900 if hinctnta==8&cntry=="DE"&essround==4 // range 45200 to
>  under 54600 mid-point 49900
(159 real changes made)

. replace income=62500 if hinctnta==9&cntry=="DE"&essround==4 // range 54600 to
>  under 70400 mid-point 62500
(108 real changes made)

. replace income=62500     if hinctnta==1&cntry=="NO"&essround==4 //      range
>    0       to      under   125000  mid-point       62500
(29 real changes made)

. replace income=147500 if hinctnta==2&cntry=="NO"&essround==4    //      range
>     125000 to      under 170000 mid-point  147500
(78 real changes made)

. replace income=195000 if hinctnta==3&cntry=="NO"&essround==4    //      range
>     170000 to      under 220000 mid-point  195000
(110 real changes made)

. replace income=245000 if hinctnta==4&cntry=="NO"&essround==4    //      range
>     220000 to      under 270000 mid-point  245000
(127 real changes made)

. replace income=297500 if hinctnta==5&cntry=="NO"&essround==4    //      range
>     270000 to      under 325000 mid-point  297500
(176 real changes made)

. replace income=362500 if hinctnta==6&cntry=="NO"&essround==4    //      range
>     325000 to      under 400000 mid-point  362500
(182 real changes made)

. replace income=437500 if hinctnta==7&cntry=="NO"&essround==4    //      range
>     400000 to      under 475000 mid-point  437500
(186 real changes made)

. replace income=512500 if hinctnta==8&cntry=="NO"&essround==4    //      range
>     475000 to      under 550000 mid-point  512500
(179 real changes made)

. replace income=610000 if hinctnta==9&cntry=="NO"&essround==4    //      range
>     550000 to      under 670000 mid-point  610000
(190 real changes made)

. replace income=2500 if hinctnta==1&cntry=="PT"&essround==4 // range less than
>  5000mid-point 2500
(45 real changes made)

. replace income=6000 if hinctnta==2&cntry=="PT"&essround==4 // range 5000 to u
> nder 7000 mid-point 6000
(121 real changes made)

. replace income=8000 if hinctnta==3&cntry=="PT"&essround==4 // range 7000 to u
> nder 9000 mid-point 8000
(166 real changes made)

. replace income=10000 if hinctnta==4&cntry=="PT"&essround==4 // range 9000 to 
> under 11000 mid-point 10000
(259 real changes made)

. replace income=12400 if hinctnta==5&cntry=="PT"&essround==4 // range 11000 to
>  under 13800 mid-point 12400
(168 real changes made)

. replace income=14900 if hinctnta==6&cntry=="PT"&essround==4 // range 13800 to
>  under 16000 mid-point 14900
(97 real changes made)

. replace income=17750 if hinctnta==7&cntry=="PT"&essround==4 // range 16000 to
>  under 19500 mid-point 17750
(59 real changes made)

. replace income=22000 if hinctnta==8&cntry=="PT"&essround==4 // range 19500 to
>  under 24500 mid-point 22000
(45 real changes made)

. replace income=29750 if hinctnta==9&cntry=="PT"&essround==4 // range 24500 to
>  under 35000 mid-point 29750
(22 real changes made)

. replace income=4000 if hinctnta==1&cntry=="ES"&essround==4 // range less than
>  8000mid-point 4000
(131 real changes made)

. replace income=9500 if hinctnta==2&cntry=="ES"&essround==4 // range 8000 to u
> nder 11000 mid-point 9500
(152 real changes made)

. replace income=12500 if hinctnta==3&cntry=="ES"&essround==4 // range 11000 to
>  under 14000 mid-point 12500
(266 real changes made)

. replace income=15500 if hinctnta==4&cntry=="ES"&essround==4 // range 14000 to
>  under 17000 mid-point 15500
(286 real changes made)

. replace income=18500 if hinctnta==5&cntry=="ES"&essround==4 // range 17000 to
>  under 20000 mid-point 18500
(234 real changes made)

. replace income=21500 if hinctnta==6&cntry=="ES"&essround==4 // range 20000 to
>  under 23000 mid-point 21500
(129 real changes made)

. replace income=25000 if hinctnta==7&cntry=="ES"&essround==4 // range 23000 to
>  under 27000 mid-point 25000
(152 real changes made)

. replace income=30000 if hinctnta==8&cntry=="ES"&essround==4 // range 27000 to
>  under 33000 mid-point 30000
(96 real changes made)

. replace income=37000 if hinctnta==9&cntry=="ES"&essround==4 // range 33000 to
>  under 41000 mid-point 37000
(81 real changes made)

. replace income=15750 if hinctnta==1&cntry=="CH"&essround==4     //      range
>    0       to      under   31500   mid-point       15750
(92 real changes made)

. replace income=38250 if hinctnta==2&cntry=="CH"&essround==4     //      range
>    31500   to      under   45000   mid-point       38250
(172 real changes made)

. replace income=50250 if hinctnta==3&cntry=="CH"&essround==4     //      range
>    45000   to      under   55500   mid-point       50250
(158 real changes made)

. replace income=60250 if hinctnta==4&cntry=="CH"&essround==4     //      range
>    55500   to      under   65000   mid-point       60250
(164 real changes made)

. replace income=70250 if hinctnta==5&cntry=="CH"&essround==4     //      range
>    65000   to      under   75500   mid-point       70250
(163 real changes made)

. replace income=81500 if hinctnta==6&cntry=="CH"&essround==4     //      range
>    75500   to      under   87500   mid-point       81500
(134 real changes made)

. replace income=94750 if hinctnta==7&cntry=="CH"&essround==4     //      range
>    87500   to      under   102000  mid-point       94750
(176 real changes made)

. replace income=112000 if hinctnta==8&cntry=="CH"&essround==4    //      range
>    102000  to      under   122000  mid-point       112000
(148 real changes made)

. replace income=139250 if hinctnta==9&cntry=="CH"&essround==4    //      range
>    122000  to      under   156500  mid-point       139250
(98 real changes made)

. replace income=4275 if hinctnta==1&cntry=="GB"&essround==4      //      range
>    0       to      under   8550    mid-point       4275
(256 real changes made)

. replace income=10010 if hinctnta==2&cntry=="GB"&essround==4     //      range
>    8550    to      under   11470   mid-point       10010
(236 real changes made)

. replace income=12955 if hinctnta==3&cntry=="GB"&essround==4     //      range
>    11470   to      under   14440   mid-point       12955
(206 real changes made)

. replace income=15900 if hinctnta==4&cntry=="GB"&essround==4     //      range
>    14440   to      under   17360   mid-point       15900
(179 real changes made)

. replace income=19240 if hinctnta==5&cntry=="GB"&essround==4     //      range
>    17360   to      under   21120   mid-point       19240
(155 real changes made)

. replace income=23385 if hinctnta==6&cntry=="GB"&essround==4     //      range
>    21120   to      under   25650   mid-point       23385
(175 real changes made)

. replace income=28260 if hinctnta==7&cntry=="GB"&essround==4     //      range
>    25650   to      under   30870   mid-point       28260
(215 real changes made)

. replace income=40490 if hinctnta==8&cntry=="GB"&essround==4     //      range
>    30870   to      under   50110   mid-point       40490
(185 real changes made)

. replace income=52015 if hinctnta==9&cntry=="GB"&essround==4     //      range
>    50110   to      under   53920   mid-point       52015
(164 real changes made)

. replace income=48600 if hinctnta==1&cntry=="SE"&essround==4     //      range
>    0       to      under   97200   mid-point       48600
(55 real changes made)

. replace income=109800 if hinctnta==2&cntry=="SE"&essround==4    //      range
>    97200   to      under   122400  mid-point       109800
(76 real changes made)

. replace income=135600 if hinctnta==3&cntry=="SE"&essround==4    //      range
>    122400  to      under   148800  mid-point       135600
(80 real changes made)

. replace income=164400 if hinctnta==4&cntry=="SE"&essround==4    //      range
>    148800  to      under   180000  mid-point       164400
(97 real changes made)

. replace income=196200 if hinctnta==5&cntry=="SE"&essround==4    //      range
>    180000  to      under   212400  mid-point       196200
(136 real changes made)

. replace income=232200 if hinctnta==6&cntry=="SE"&essround==4    //      range
>    212400  to      under   252000  mid-point       232200
(166 real changes made)

. replace income=283800 if hinctnta==7&cntry=="SE"&essround==4    //      range
>    252000  to      under   315600  mid-point       283800
(251 real changes made)

. replace income=356400 if hinctnta==8&cntry=="SE"&essround==4    //      range
>    315600  to      under   397200  mid-point       356400
(303 real changes made)

. replace income=445800 if hinctnta==9&cntry=="SE"&essround==4    //      range
>    397200  to      under   494400  mid-point       445800
(316 real changes made)

. replace income=5850 if hinctnta==1&cntry=="NL"&essround==4 // range 0 or more
>  mid-point 5850
(87 real changes made)

. replace income=13350 if hinctnta==2&cntry=="NL"&essround==4 // range 11700 or
>  more mid-point 13350
(108 real changes made)

. replace income=16600 if hinctnta==3&cntry=="NL"&essround==4 // range 15000 or
>  more mid-point 16600
(147 real changes made)

. replace income=19850 if hinctnta==4&cntry=="NL"&essround==4 // range 18200 or
>  more mid-point 19850
(146 real changes made)

. replace income=23400 if hinctnta==5&cntry=="NL"&essround==4 // range 21500 or
>  more mid-point 23400
(175 real changes made)

. replace income=27400 if hinctnta==6&cntry=="NL"&essround==4 // range 25300 or
>  more mid-point 27400
(153 real changes made)

. replace income=31850 if hinctnta==7&cntry=="NL"&essround==4 // range 29500 or
>  more mid-point 31850
(177 real changes made)

. replace income=37200 if hinctnta==8&cntry=="NL"&essround==4 // range 34200 or
>  more mid-point 37200
(192 real changes made)

. replace income=45250 if hinctnta==9&cntry=="NL"&essround==4 // range 40200 or
>  more mid-point 45250
(190 real changes made)

. 
. 
. /* Values for top-coded categories */
. 
. /* For 2002-2006  */
. gen hinctnt11=.
(108536 missing values generated)

. replace hinctnt11=1 if (hinctnt==11&essround<4)|(hinctnta==9&essround==4)
(3676 real changes made)

. gen hinctnt12=.
(108536 missing values generated)

. replace hinctnt12=1 if (hinctnt==12&essround<4)|(hinctnta==9&essround==4)
(3126 real changes made)

. 
. by cntry essround, sort: egen freqtopminus1=count(hinctnt11)

. by cntry essround, sort: egen freqtop=count(hinctnt12)

. 
. gen v=((ln(freqtopminus1+freqtop))-ln(freqtop))/(ln(120000)-ln(90000))
(3549 missing values generated)

. replace income=120000*(v/(v-1)) if hinctnt==12 // range 120000 or more, mid-p
> oint Hout 2004
(1082 real changes made)

. 
. /* For 2004 */
. gen topmax=.
(108536 missing values generated)

. gen topmin=.
(108536 missing values generated)

. replace topmax=35000 if cntry=="BE"&essround==4 // range 35000
(1760 real changes made)

. replace topmax=534000 if cntry=="DK"&essround==4 //     range   450000  to   
>    under   534000
(1610 real changes made)

. replace topmax=55200 if cntry=="FI"&essround==4 // range 55200
(2195 real changes made)

. replace topmax=49200 if cntry=="FR"&essround==4 // range 49200
(2073 real changes made)

. replace topmax=70400 if cntry=="DE"&essround==4 // range 70400
(2751 real changes made)

. replace topmax=670000 if cntry=="NO"&essround==4 //     range   550000  to   
>    under   670000
(1549 real changes made)

. replace topmax=35000 if cntry=="PT"&essround==4 // range 35000
(2367 real changes made)

. replace topmax=41000 if cntry=="ES"&essround==4 // range 41000
(2576 real changes made)

. replace topmax=156500 if cntry=="CH"&essround==4 //     range   122000  to   
>    under   156500
(1819 real changes made)

. replace topmax=53920 if cntry=="GB"&essround==4 //      range   50110   to   
>    under   53920
(2352 real changes made)

. replace topmax=50300 if cntry=="NL"&essround==4 // range 50300
(1778 real changes made)

. replace topmax=494400 if cntry=="SE"&essround==4 //     range   397200  to   
>    under   494400
(1830 real changes made)

. 
. replace topmin=26000 if cntry=="BE"&essround==4 // range 35000
(1760 real changes made)

. replace topmin=450000 if cntry=="DK"&essround==4 //     range   450000  to   
>    under   534000
(1610 real changes made)

. replace topmin=44400 if cntry=="FI"&essround==4 // range 55200
(2195 real changes made)

. replace topmin=39600 if cntry=="FR"&essround==4 // range 49200
(2073 real changes made)

. replace topmin=54600 if cntry=="DE"&essround==4 // range 70400
(2751 real changes made)

. replace topmin=550000 if cntry=="NO"&essround==4 //     range   550000  to   
>    under   670000
(1549 real changes made)

. replace topmin=24500 if cntry=="PT"&essround==4 // range 35000
(2367 real changes made)

. replace topmin=33000 if cntry=="ES"&essround==4 // range 41000
(2576 real changes made)

. replace topmin=122000 if cntry=="CH"&essround==4 //     range   122000  to   
>    under   156500
(1819 real changes made)

. replace topmin=50110 if cntry=="GB"&essround==4 //      range   50110   to   
>    under   53920
(2352 real changes made)

. replace topmin=40200 if cntry=="NL"&essround==4 // range 50300
(1778 real changes made)

. replace topmin=397200 if cntry=="SE"&essround==4 //     range   397200  to   
>    under   494400
(1830 real changes made)

. 
. gen v4=((ln(freqtopminus1+freqtop))-ln(freqtop))/(ln(topmax)-ln(topmin)) if e
> ssround==4
(83876 missing values generated)

. replace income=topmax*(v4/(v4-1)) if hinctnta==10
(2143 real changes made)

. 
. drop v v4 topmin topmax hinctnt11 hinctnt12 freqtopminus1 freqtop

. 
. 
. /* PPP 2005 conversion */
. 
. merge m:1 cntry year using ppp_cpi

    Result                           # of obs.
    -----------------------------------------
    not matched                            72
        from master                         0  (_merge==1)
        from using                         72  (_merge==2)

    matched                           108,536  (_merge==3)
    -----------------------------------------

. tab year if _merge==2

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2003 |         14       19.44       19.44
       2005 |         14       19.44       38.89
       2007 |         14       19.44       58.33
       2008 |          2        2.78       61.11
       2009 |         14       19.44       80.56
       2010 |         14       19.44      100.00
------------+-----------------------------------
      Total |         72      100.00

. drop if _merge==2
(72 observations deleted)

. drop _merge

. 
. /* national income ESS exchange rates 2002-2006 */
. gen natincome=income
(21956 missing values generated)

. replace natincome=income*(7.4) if cntry=="DK" & (essround==1 | essround==2 | 
> essround==3)
(3909 real changes made)

. replace natincome=income*(7.17) if cntry=="NO" & (essround==1 | essround==2 |
>  essround==3)
(5366 real changes made)

. replace natincome=income*(9.4) if cntry=="SE" & (essround==1 | essround==2 | 
> essround==3)
(5454 real changes made)

. replace natincome=income*(1.5) if cntry=="CH" & (essround==1 | essround==2 | 
> essround==3)
(4717 real changes made)

. replace natincome=income*(.66) if cntry=="GB" & (essround==1 | essround==2 | 
> essround==3)
(5125 real changes made)

. 
. /* Turn into national currency, year 2005 */
. gen natincome2005=natincome*100/cpi2005
(21956 missing values generated)

. 
. /* Turn into PPP corrected US dollars 2005 */
. gen income_ppp2005=natincome2005/ppp2005
(21956 missing values generated)

. 
. /* clean intermediary variables */
. drop natincome natincome2005 income

. 
. 
. /*=========\
> | Industry |
> \=========*/
. 
. gen temp = nacer1

. drop nacer1 

. gen nacer1 = int(temp/10)

. recode nacer1 (66/99=99)
(nacer1: 9949 changes made)

. 
. 
. * ===============
. * =  left right =
. * ===============
. recode lrscale (77 88 99=.),gen(lright)
(10967 differences between lrscale and lright)

. 
. 
. * ======================
. * =    ESEC classes    =
. * ======================
. recode iscoco (66666/99999=.), gen(isco4)
(10359 differences between iscoco and isco4)

. recode jbspv (1=1) (else = 0), gen(supvis)
(76576 differences between jbspv and supvis)

. recode emplno (66666/99999=-1)
(emplno: 97254 changes made)

. recode emplrel (2=1)(else =0), gen(sempl)
(108536 differences between emplrel and sempl)

. qui do "isco2esec.do"

. isco2esec esec, isco(isco4) sv(supvis) sempl(sempl) emplno(emplno)
Don't panic ....
OK

. recode esec (4 5 = 4) (.=99)
(esec: 14432 changes made)

. 
. 
. * ===================
. * = Religion        =
. * ===================
. *current denom
. recode rlgdnm (1=1 "cath")(2=2 "prot")(3/8 =3 "other")(66=0 "none") (77 99 = 
> .),gen (denom)
(48881 differences between rlgdnm and denom)

. * church attendance
. recode rlgatnd (77 88 99=.)
(rlgatnd: 436 changes made)

. vreverse  rlgatnd ,gen(attend)

. 
. 
. 
. * ==============
. * =  more .... =
. * ==============
. * things to use for superefficient imputation
. * children in household
. recode chldhm (1=1)(2 9=0),gen(children)
(69500 differences between chldhm and children)

. * divorced
. recode dvrcdev (1=1)(2 6 7 8 9=0),gen(divorce)
(102640 differences between dvrcdev and divorce)

. * life satisfaction
. recode stflife (77/99=.)
(stflife: 433 changes made)

. *subj. health
. recode health (7 8 9 =.)
(health: 109 changes made)

. * N household members
. recode hhmmb (77/99=.)
(hhmmb: 123 changes made)

. * living in urban area?
. recode domicil (7 8 9=.)
(domicil: 316 changes made)

. * feeling about income
. recode hincfel (7 8 9 =.)
(hincfel: 2640 changes made)

. 
. /* gen weight variable */
. gen weight = dweight*pweight

. 
. 
. 
. * =================================================================
. * = remove some cases............................................ =
. * =================================================================
. 
. * drop respondents under 18 and with missing gender
. drop if age < 18
(3938 observations deleted)

. drop if age == 123
(1 observation deleted)

. drop if female == .
(118 observations deleted)

. * drop countryyears with too coarse region info
. * dk in ess4 reduced to 5 regions (instead of 15)
. drop if cntryyear=="DK4"
(1550 observations deleted)

. * IE 3 only coarse region cat.
. drop if cntryyear=="IE3"
(1674 observations deleted)

. drop if cntryyear=="FI1"
(1891 observations deleted)

. drop if cntryyear=="FI2"
(1924 observations deleted)

. 
. * drop missing age (will not be used in listw. analyses, nor do we impute it)
. count
97440

. dropmiss age, obs any force
(312 observations deleted)

. count
97128

. 
. 
. * =================================================================
. * =    output to file ........................................... =
. * =================================================================
. 
. egen cntryn = group(cntry)

. compress
  emplno was long now int
  year was float now int
  age was float now int
  lmtctr was float now byte
  temp was float now int
  nacer1 was float now byte
  isco4 was long now int
  esec was float now byte
  cntryn was float now byte
  cntryyear was str6 now str3
  (2,428,200 bytes saved)

. sort cntry year idno

. 
. keep cntry cntryyear rincd age female eduyrs lmtctr transfer uempl3 income_pp
> p2005 esec lright children divorce stflife health hhmmb domicil hincfel regio
> nat regionbe regionch regionde regiondk regiones regionfr regiongb regionie r
> egionnl regionno regionpt regionse regioach regioafi regioaes regioapt year w
> eight iscoco nacer1 fear equalop victim denom attend hincsrc 

. 
. gen idno = _n

. 
. saveold working, replace
(note: file working.dta not found)
file working.dta saved

. 
. 
. rm ess1.dta

. rm ess2.dta

. rm ess3.dta

. rm ess4.dta

. 
. 
. 
end of do-file
